//1)
// addEventListener გამოიყენება ელემენტზე მოვლენის (Event) დასამატებლად.
// მისი საშუალებით შეგვიძლია განვსაზღვროთ, რა მოხდეს კონკრეტული მოქმედებისას,
// მაგალითად, ღილაკზე დაჭერისას (click)



//2)
// Event Propagation არის მოვლენის გავრცელების პროცესი DOM-ის ელემენტებს შორის.
// მაგალითად, თუ ღილაკი მოთავსებულია div-ის შიგნით და ღილაკს დავაჭერთ,
// მოვლენა შეიძლება გავრცელდეს მშობელ და შვილ ელემენტებს შორის.
// Event Propagation შედგება სამი ეტაპისგან:
// 1. Capturing Phase — მოვლენა მშობელი ელემენტებიდან შვილ ელემენტისკენ ვრცელდება.
// 2. Target Phase — მოვლენა უშუალოდ იმ ელემენტზე მუშავდება, რომელსაც დავაჭირეთ.
// 3. Bubbling Phase — მოვლენა შვილიდან მშობელი ელემენტებისკენ ვრცელდება.



//3)
// Bubbling:
// მოვლენა იწყება სამიზნე ელემენტიდან და შემდეგ გადადის მშობელ ელემენტებზე.
// addEventListener-ის მესამე პარამეტრი ნაგულისხმევად false-ია.
// Capturing:
// მოვლენა მშობელი ელემენტებიდან სამიზნე ელემენტისკენ ვრცელდება.
// addEventListener-ის მესამე პარამეტრი true უნდა იყოს




